import { Container } from "react-bootstrap";
import Head from "next/head";
import Link from "next/link";
import styles from "./privacy.module.css"
import { Noto_Sans_Thai } from "next/font/google";
import { serverSideTranslations } from "next-i18next/serverSideTranslations";
const noto_sans_thai = Noto_Sans_Thai({ weight: "400", subsets: ["thai"] });

const PrivacyPolicy = () => {
   return (
      <div className={noto_sans_thai.className}>
         <Head>
            <title>นโยบายความเป็นส่วนตัว</title>
            <meta name="description" content="Meta description for the Home page" />
         </Head>
         <Container fluid={true} className={styles.privacy_policy_container}>
            <Container className={styles.privacy_policy_bg}>
               <figure className="text-center pt-4 pb-4 text-light">
                  <blockquote className="blockquote">
                     <p className="display-4">นโยบายความเป็นส่วนตัว</p>
                  </blockquote>
               </figure>

            </Container>
            <Container className={styles.privacy_policy_info}>
               <Container className="p-2 text-start">
                  <p className="">
                     ในฐานะผู้พัฒนาและทีมงานของเว็บไซต์ Prompt Lab (<Link href="/" className="text-light">www.prompt.sutmeme.com</Link>) ทางทีมงานได้ตระหนักถึงความสำคัญของความเป็นส่วนตัวของผู้ใช้ทุกท่าน เราจึงให้ควาามเชื่อมั่นแก่ทุกท่านว่าข้อมูลส่วนบุคคลทั้งหมดของท่านจะได้รับความคุ้มครองและ
                     รับประกันว่าจะปกป้องและประมวลผลข้อมูลส่วนบุคคลด้วยมาตรการรักษาความมั่นคงปลอดภัยที่เหมาะสม
                     อย่างดีที่สุดและด้วยชอบด้วยกฏหมาย
                  </p>
               </Container>
               <Container className="p-2 text-start">
                  <p>
                     ทางทีมงานอาจปรับปรุงนโยบายความเป็นส่วนตัวฉบับนี้ตามแต่ละระยะเวลา เพื่อให้สอดคล้องกับแนวปฏิบัติและกฎหมายที่เกี่ยวข้อง
                     และให้สอดคล้องกับการให้บริการต่างๆ ทั้งนี้ ทางทีมงานจะแจ้งให้ท่านทราบถึงการเปลี่ยนแปลง
                     ด้วยการประกาศนโยบายฉบับปรับปรุงใหม่ผ่านทางเว็บไซต์
                  </p>
               </Container>

               <Container className="text-start display-6 pt-4 p-0">
                  <div className="pb-2"> การเก็บข้อมูลส่วนบุคคล </div>
                  <hr className="m-0 mb-2 bg-white " style={{ height: "1px" }} />
               </Container>
               <Container className="text-start pt-4">
                  <div className="pb-2">
                     <b> {"(1) ข้อมูลส่วนบุคคล"} </b>
                     <div>
                        {"\"ข้อมูลส่วนบุคคล\""} คือ ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้น
                        ได้ไม่ว่าทางตรงหรือทางอ้อม โดยที่เรานั้นได้รวบรวมข้อมูลส่วนบุคคลในกรณีที่จำเป็นและใช้ข้อมูลเท่านั้น
                        ประกอบไปด้วย
                     </div>
                     <ul>
                        <li> ชื่อ-นามสกุล(ไม่จำเป็น) </li>
                        <li> อีเมลของผู้ใช้ </li>
                     </ul>
                  </div>

                  <div className="pb-2">
                     <b> {"(2) ข้อมูลที่ไม่สามารถระบุตัวตนได้"} </b>
                     <p>
                        {"\"ข้อมูลที่ไม่สามารถระบุตัวตน\""} คือข้อมูลที่ไม่สามารถระบุตัวตนของบุคคลได
                        ซึ่งไม่ได้เชื่อมโยงกับข้อมูลส่วนบุคคล โดยตัวอย่างเช่น ข้อมูล IP Address ของผู้ใช้,
                        ข้อมูลเวลาเข้าเว็บไซต์, ข้อมูลเบราว์เซอร์ที่ใช้, ข้อมูลสถิติการใช้งานเว็บไซต์,
                        ข้อมูลการใช้งานเว็บไซต์ในแต่ละช่วงเวลา, ข้อมูลการใช้ฟีเจอร์แต่ละส่วน เป็นต้น
                     </p>
                  </div>

                  <div className="pb-2">
                     <b> {"(3) ข้อมูลการใช้งาน"} </b>
                     <p>
                        {"\"ข้อมูลการใช้งาน\""} คือข้อมูลการใช้งานเว็บไซต์ของผู้ใช้ ได้แก่ ประวัติการใช้งานแต่ละฟีเจอร์ของผู้ใช้,
                        ประวัติการสร้างข้อความของผู้ใช้แต่ละคน, ประวัติการคลิ๊กเข้าโฆษณา
                     </p>
                  </div>

                  <div className="pb-4">
                     <b> {"(4) คุกกี้และเทคโนโลยีติดตาม"} </b>
                     <p>
                        {"\"คุกกี้\""} คือ ไฟล์ขนาดเล็กที่เก็บไว้บนคอมพิวเตอร์ของคุณ (หรืออุปกรณ์อื่น ๆ ที่ต่ออินเตอร์เน็ต เช่น
                        สมาร์ทโฟนหรือแท๊บเล็ต)
                     </p>
                  </div>

                  <div>
                     <h5>การเก็บข้อมูลส่วนบุคคลจะเกิดขึ้นอยู่ 3 กรณี ได้แก่</h5>
                     <div>
                        <b> {"(1) เมื่อมีการเข้าสู่ระบบ"} </b>
                        <p>
                           เมื่อมีการเข้าสู่ระบบ ระบบจะบันทึกข้อมูลการเข้าสู่ระบบ ได้แก่ ชื่อผู้ใช้และอีเมล
                           เพื่อวิเคราะห์ข้อมูลการใช้งานเว็บไซต์ เช่น ปริมาณการเข้าถึงเว็บไซต์ในแต่ละช่วงเวลา,
                           ช่วงเวลาที่ผู้ใช้งานใช้เว็บไซต์มากที่สุด และอื่นๆ
                        </p>
                     </div>


                     <div>
                        <b> {"(2) เมื่อมีการกดคลิ๊กเข้าโฆษณา"} </b>
                        <p>

                           เมื่อมีการกดคลิ๊กเข้าโฆษณา เมื่อผู้ใช้งานคลิ๊กเข้าโฆษณา ระบบจะบันทึกข้อมูลการคลิกโฆษณา
                           ได้แก่ โฆษณาที่ถูกคลิ๊ก, ผู้ใช้ที่กดเข้าโฆษณา,
                           วันเวลาที่กดเข้าโฆษณา
                        </p>
                     </div>

                     <div>
                        <b> {"(3) เมื่อมีการกดสร้างข้อความ"} </b>
                        <p>
                           เมื่อมีการกดสร้างข้อความ เมื่อผู้ใช้งานกดสร้างข้อความ เช่น เขียนแคปชั่นขายของ, ช่วยคิดคอนเทนต์
                           ระบบจะบันทึกข้อมูลการสร้างข้อความ ได้แก่ ผู้ใช้ที่สร้าง, ข้อความที่เป็น Input,
                           ลักษณะของข้อความที่จะสร้าง, วันเวลาที่กดสร้าง และข้อความผลลัพธ์ที่ได้
                        </p>
                     </div>
                  </div>
               </Container>
               <Container className="text-start display-6 pt-4">
                  <div className="pb-2"> เราจะนำข้อมูลส่วนบุคคลไปใช้อะไรบ้าง </div>
                  <hr className="m-0 mb-2 bg-white " style={{ height: "1px" }} />
               </Container>
               <Container className="text-start">
                  <div>
                     <b>{"(1) การปรับปรุงและพัฒนาผลิตภัณฑ์และบริการ"}</b>
                     <p>
                        ทีมงาน Prompt Lab อาจใช้ข้อมูลส่วนบุคคลเพื่อดำเนินการปรับปรุงและพัฒนาผลิตภัณฑ์และบริการของเรา
                        เพื่อตอบสนองความต้องการและความพึงพอใจของผู้ใช้งาน การใช้ข้อมูลเหล่านี้จะไม่เปิดเผยต่อบุคคลภายนอก
                        และเราจะตรวจสอบว่าการใช้งานผลิตภัณฑ์และบริการของเราเป็นไปอย่างไรเพื่อให้เราสามารถปรับปรุงประสิทธิภาพในการใช้งานให้ดียิ่งขึ้น
                     </p>
                  </div>

                  <div>
                     <b>{"(2) การสื่อสารกับผู้ใช้งาน"}</b>
                     <p>
                        ทีมงาน Prompt Lab อาจใช้ข้อมูลส่วนบุคคลของผู้ใช้งานเพื่อสื่อสารกับผู้ใช้งาน อาทิเช่นการตอบกลับคำถาม
                        การแจ้งเตือนเกี่ยวกับบริการ การส่งข่าวสารและการแจ้งเตือนอื่นๆ ผ่านทางอีเมลหรือการติดต่อผ่านช่องทางอื่นๆ ที่ผู้ใช้งานได้ระบุไว้
                     </p>
                  </div>

                  <div>
                     <b>{"(3) การวิเคราะห์และทำสถิติ"}</b>
                     <p>
                        ทีมงาน Prompt Lab จะใช้เทคโนโลยีและเครื่องมือต่างๆ เพื่อวิเคราะห์และทำสถิติข้อมูลของผู้ใช้งาน ในการปรับปรุงและพัฒนาบริการของเราให้มีประสิทธิภาพมากยิ่งขึ้น
                        โดยเราจะเก็บข้อมูลเฉพาะที่จำเป็นและไม่เก็บข้อมูลส่วนบุคคลใดๆ ที่สามารถระบุตัวตนของผู้ใช้งานได้โดยตรง
                        เราจะใช้ข้อมูลสถิติเพื่อวิเคราะห์แนวโน้มการใช้บริการของผู้ใช้งาน เช่น จำนวนผู้ใช้งานที่เข้าชมเว็บไซต์ของเราในแต่ละวัน
                        ช่วงเวลาที่ผู้ใช้งานใช้บริการของเรา และพฤติกรรมการใช้งานอื่นๆ โดยเราจะไม่เปิดเผยข้อมูลส่วนบุคคลใดๆ ของผู้ใช้งานให้แก่บุคคลภายนอกโดยไม่ได้รับอนุญาตก่อน
                     </p>
                  </div>

                  <div>
                     <b>{"(4) การตรวจสอบความปลอดภัยและป้องกันการโจมตี"}</b>
                     <p>
                        ทีมงาน Prompt Lab ให้ความสำคัญกับการรักษาความปลอดภัยของข้อมูลของผู้ใช้งาน
                        เรามีการตรวจสอบและป้องกันการโจมตีเพื่อให้ข้อมูลของผู้ใช้งานปลอดภัย
                        และไม่ถูกเข้าถึงโดยไม่ได้รับอนุญาต ดังนั้นเรามีมาตรการความปลอดภัยต่างๆ ซึ่งรวมถึง
                     </p>
                     <ul>
                        <li>การใช้เทคโนโลยีที่เหมาะสม: เราใช้เทคโนโลยีที่เหมาะสมเพื่อป้องกันการเข้าถึงข้อมูลของผู้ใช้งานโดยไม่ได้รับอนุญาต </li>
                        <li>การเก็บข้อมูลที่ปลอดภัย: เราเก็บข้อมูลของผู้ใช้งานในที่ปลอดภัยและใช้มาตรการความปลอดภัยที่เหมาะสม
                           เพื่อป้องกันการเข้าถึงข้อมูลโดยไม่ได้รับอนุญาต ซึ่งรวมถึงการใช้เทคโนโลยีเข้ารหัสและการจัดการความปลอดภัยทางซอฟต์แวร์</li>
                        <li>
                           การตรวจสอบความปลอดภัยเป็นระยะๆ: เรามีการตรวจสอบความปลอดภัยเป็นระยะๆ เพื่อให้มั่นใจว่าข้อมูลของผู้ใช้งาน
                           ปลอดภัยและไม่ถูกเข้าถึงโดยไม่ได้รับอนุญาต นอกจากนี้เรายังมีการปรับปรุงมาตรการความปลอดภัยเป็นระยะๆ
                           เพื่อตอบสนองความเปลี่ยนแปลงของเทคโนโลยีและมีการทดสอบเพื่อตรวจสอบว่ามีช่องโหว่ด้านความปลอดภัยอยู่หรือไม่
                        </li>
                     </ul>
                  </div>

                  <div>
                     การปฏิบัติตามข้อกำหนดและกฎหมายที่เกี่ยวข้อง
                     ทีมงาน Prompt Lab จะเก็บรวบรวมข้อมูลของท่านเฉพาะข้อมูลที่จำเป็น และถูกเก็บรักษาไว้อย่างดีที่สุด
                     ตามหลักเกณฑ์การเก็บรักษาข้อมูลที่เป็นความลับของผู้ใช้งาน ซึ่งเป็นไปตามที่กฏหมายกำหนด และตามกฎเกณฑ์ต่าง ๆ ที่เกี่ยวข้องภายใต้การบังคับใช้และตีความตามกฎหมายไทย
                  </div>

               </Container>
               <Container className="display-6 pt-4 text-start">
                  <div className="pb-2"> การแชร์ข้อมูลกับบุคคลที่สาม </div>
                  <hr className="m-0 mb-2 bg-white " style={{ height: "1px" }} />
               </Container>

               <Container className="text-start">
                  <text>
                     <p>
                        ทีมงาน Prompt Lab มีนโยบายความเป็นส่วนตัวในการแชร์ข้อมูลกับบุคคลที่สามที่มุ่งเน้นในการคุ้มครองข้อมูลส่วนบุคคลของลูกค้า โดยเราจะไม่ขายหรือให้เช่าข้อมูลส่วนบุคคลของคุณให้แก่บุคคลที่สามโดยไม่ได้รับความยินยอมจากคุณ
                        ข้อมูลส่วนบุคคลของคุณอาจถูกแชร์เมื่อจำเป็นสำหรับการให้บริการ การปฏิบัติตามกฎหมาย หรือเพื่อปรับปรุงบริการ
                        โดยทีมงาน Prompt Lab จะใช้มาตรการความปลอดภัยที่เหมาะสมในการป้องกันข้อมูลของคุณจากการเข้าถึง การเปิดเผย
                        การปรับปรุง หรือการทำลายโดยไม่ได้รับอนุญาต อย่างไรก็ตาม ความปลอดภัยของข้อมูลบนอินเทอร์เน็ตไม่สามารถรับประกันได้
                        100%
                     </p>
                  </text>
               </Container>

               <Container className="text-start display-6 pt-4">
                  <div className="pb-2"> การจัดเก็บข้อมูลและความปลอดภัย </div>
                  <hr className="m-0 mb-2 bg-white " style={{ height: "1px" }} />

               </Container>

               <Container className="text-start">
                  <text>
                     เราให้ความสำคัญในการรักษาความปลอดภัยของข้อมูลของผู้ใช้ ดังนั้น เรามีนโยบายในการจัดเก็บข้อมูลเพื่อให้เป็นไปตามมาตรการความปลอดภัยที่เหมาะสม วิธีการจัดเก็บข้อมูลของเราประกอบด้วยการเก็บข้อมูลแบบเข้ารหัสและเก็บไว้ที่เซิร์ฟเวอร์บนคลาวด์
                     ทีมงาน Prompt Lab อาจไม่สามารถลบข้อมูลทั้งหมดของท่านออกจากฐานข้อมูลของทีมงาน Prompt Lab ได้อย่างสมบูรณ์โดยไม่มีข้อมูลที่เหลืออยู่เนื่องจากการสำรองข้อมูลและเหตุผลอื่นๆ ทีมงาน Prompt Lab จะเก็บรักษาข้อมูลของท่านตราบเท่าที่ข้อมูลนั้นยังจำเป็นสำหรับวัตถุประสงค์ของการรวบรวมข้อมูล
                     ในกรณีที่ท่านยุติความสัมพันธ์ทางธุรกิจกับทีมงาน Prompt Lab ไปแล้ว ทีมงาน Prompt Lab จะจัดเก็บข้อมูลส่วนบุคคลของท่านไว้เป็นระยะเวลา 10 ปี ซึ่งเป็นไปตามที่กฎหมายกำหนด
                     เช่น กฎหมายว่าด้วยการบัญชี กฎหมายว่าด้วยการป้องกันและปราบปรามการฟอกเงิน กฎหมายภาษีอากร และตามนโยบาย คู่มือต่างๆ ในเรื่องการจัดเก็บและทำลายเอกสารต่างๆ ของทีมงาน Prompt Lab
                     และเมื่อสิ้นสุดระยะเวลาในการเก็บแล้วทีมงาน Prompt Lab จะทำการลบทำลาย หรือทำให้ข้อมูลดังกล่าวไม่สามารถระบุถึงตัวบุคคลได้
                  </text>
               </Container>


               <Container className="display-6 pt-4 text-start">
                  <div className="pb-2">สิทธิของผู้ใช้งาน</div>
                  <hr className="m-0 mb-2 bg-white " style={{ height: "1px" }} />
               </Container>


               <Container className="pt-3 text-start">
                  <div className="pb-4">
                     เราทีมงาน Prompt Lab ให้ความสำคัญกับความเป็นส่วนตัวของคุณและมุ่งมั่นที่จะปกป้องข้อมูลส่วนบุคคลของคุณ
                     นโยบายความเป็นส่วนตัวนี้อธิบายวิธีการเก็บรวบรวม ใช้งานและแบ่งปันข้อมูลส่วนบุคคลของคุณ รวมถึงสิทธิของคุณในฐานะผู้ใช้งาน
                  </div>
                  <h5>โดยในฐานะผู้ใช้งาน คุณมีสิทธิต่อข้อมูลส่วนบุคคลของคุณดังนี้</h5>
                  <div className="pb-1">
                     <b>{"(1) สิทธิในการขอเข้าถึงข้อมูล"}</b> คุณมีสิทธิในการขอเข้าถึงข้อมูลส่วนบุคคลของคุณที่เราได้รวบรวมไว้ทั้งหมด
                  </div>

                  <div className="pb-1">
                     <b>{"(2) สิทธิในการแก้ไขข้อมูล"}</b> คุณมีสิทธิในการขอให้เราแก้ไขข้อมูลส่วนบุคคลที่ไม่ถูกต้องหรือไม่สมบูรณ์เกี่ยวกับคุณทั้งหมด
                  </div>

                  <div className="pb-1">
                     <b>{"(3) สิทธิในการลบข้อมูล"}</b> คุณมีสิทธิในการขอให้เราลบข้อมูลส่วนบุคคลของคุณในกรณีบางกรณี เช่น
                     เมื่อไม่จำเป็นต่อวัตถุประสงค์ที่ได้รับการเก็บรวบรวมไว้ หรือไม่ต้องการให้ทางเรารวบรวมข้อมูลที่คุณไม่ต้องการบางส่วน
                  </div>

                  <div className="pb-1">
                     <b>{"(4) สิทธิในการจัดกานประมวลผล"}</b> คุณมีสิทธิในการขอให้เราจำกัดการประมวลผลข้อมูลส่วนบุคคลของคุณในกรณีบางกรณี เช่น เมื่อคุณโต้แย้งความถูกต้องของข้อมูลหรือเมื่อการประมวลผลนั้นผิดกฎหมาย
                  </div>

                  <div className="pb-1">
                     <b>{"(5) สิทธิในการย้ายข้อมูล"}</b> คุณมีสิทธิในการขอให้เราให้คุณได้รับสำเนาของข้อมูลส่วนบุคคลของคุณในรูปแบบที่ถูกต้อง และสามารถอ่านได้โดยเครื่องจักรได้
                  </div>

                  <div className="pb-1">
                     <b>{"(6) สิทธิในการคัดค้าน"}</b> คุณมีสิทธิในการคัดค้านการประมวลผลข้อมูลส่วนบุคคลของคุณในกรณีบางกรณี เช่น เมื่อเราใช้ข้อมูลของคุณเพื่อวัตถุประสงค์ทางการตลาด
                  </div>

                  <div>
                     ถ้าคุณต้องการใช้สิทธิ์ใดสิทธิ์หนึ่งที่กล่าวมาข้างต้น โปรดติดต่อเราโดยใช้ข้อมูลติดต่อที่ให้ไว้ด้านล่าง
                     วิธีการป้องกันข้อมูลส่วนบุคคลของคุณ เราใช้มาตรการที่เหมาะสมเพื่อปกป้องข้อมูลส่วนบุคคลของคุณไม่ให้มีการเข้าถึงโดยไม่ได้รับอนุญาต การใช้เทคโนโลยีการเข้ารหัสและมาตรการความปลอดภัยตาม
                     กฏหมาย PDPA (พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ.2562) โดยสิ่งที่เราทำเพื่อป้องกันข้อมูลของคุณไม่ให้ถูกเปิดเผย
                  </div>

                  <div>
                     การเปลี่ยนแปลงที่เกี่ยวกับนโยบายความเป็นส่วนตัวของเรา
                     เราขอสงวนสิทธิ์ในการอัปเดตนโยบายความเป็นส่วนตัวนี้ได้ตลอดเวลา
                     และเราขอแนะนำให้คุณตรวจสอบนโยบายนี้เป็นระยะๆ เพื่อติดตามการเปลี่ยนแปลง
                  </div>
               </Container>

               <Container className="display-6 pt-4 text-start">
                  <div className="pb-2">การแชร์ข้อมูลกับบุคคลที่สาม</div>
                  <hr className="m-0 mb-2 bg-white " style={{ height: "1px" }} />
               </Container>

               <Container className="pt-3 text-start">
                  <div>
                     <b> {"(1) สิทธิ์ในการขอเข้าถึงข้อมูล"} </b>
                     <p>
                        การขอให้เปิดเผยและโอนข้อมูลส่วนบุคคลไปยังบุคคลอื่นด้วยวิธีการอัตโนมัติ การจำกัดหรือระงับการใช้
                        การปฏิเสธการประมวลผลข้อมูล ผู้ใช้สามารถขอให้ทางทีมงานของเว็บไซต์ Prompt Lab จำกัดสิทธิ์ในการขอเข้าถึงข้อมูลได้
                     </p>
                  </div>

                  <div>
                     <b> {"(2) การแก้ไขหรือลบข้อมูลส่วนบุคคล"} </b>
                     <p>
                        ผู้ใช้งานสามารถแก้ไข หรือลบข้อมูลส่วนบุคคลของท่านได้ตลอดเวลา โดยทั้งนี้ การลบข้อมูลอาจทำให้
                        ผู้ใช้งานไม่สามารถรับบริการบางส่วนของทางเว็บไซต์ Prompt Lab ได้
                        หรืออาจทำให้การให้บริการหรือการใช้งานไม่ดีเท่าที่ควร
                     </p>
                  </div>

                  <div>
                     <b> {"(3) สิทธิ์ในการยกเลิกความยินยอม"} </b>
                     <p>
                        ผู้ใช้งานสามารถถอน หรือยกเลิกความยินยอมของท่านได้ให้แก่ทีมงาน Prompt Lab
                        เกี่ยวกับการประมวลผลข้อมูลหรือกิจกรรมที่เฉพาะเจาะจงต่างๆได้ในทุกเวลา
                     </p>
                  </div>

                  <div>
                     ทีมงาน Prompt Lab มีนโยบายความเป็นส่วนตัวในการแชร์ข้อมูลกับบุคคลที่สามที่มุ่งเน้นในการคุ้มครองข้อมูลส่วนบุคคลของลูกค้า
                     โดยเราจะไม่ขายหรือให้เช่าข้อมูลส่วนบุคคลของคุณให้แก่บุคคลที่สามโดยไม่ได้รับความยินยอมจากคุณ ข้อมูลส่วนบุคคลของคุณอาจถูกแชร์เมื่อจำเป็นสำหรับการให้บริการ
                     การปฏิบัติตามกฎหมาย หรือเพื่อปรับปรุงบริการ โดยทีมงาน Prompt Lab จะใช้มาตรการความปลอดภัยที่เหมาะสมในการป้องกันข้อมูลของคุณจากการเข้าถึง
                     การเปิดเผย การปรับปรุง หรือการทำลายโดยไม่ได้รับอนุญาต อย่างไรก็ตาม ความปลอดภัยของข้อมูลบนอินเทอร์เน็ตไม่สามารถรับประกันได้ 100%
                  </div>
               </Container>

               <Container className="text-start pt-4 pb-4">
                  <p>
                     โดยทั้งนี้หากท่านมาความประสงค์ที่จะใช้สิทธิ์ต่างๆของผู้ใช้งานที่ได้กำหนดไว้ในข้างต้น ท่านสามารถติดต่อกับ
                     ทางทีมงานของเว็บไซต์ Prompt Lab ผ่านช่องทาง Email : <b><u>just.solution.th@gmail.com</u> </b>
                     ได้ตลอด 24 ชั่วโมง
                  </p>
               </Container>
               {/* 
                */}
            </Container>

         </Container>
      </div>

   );
}


export const getServerSideProps = async ({ locale }: any) => ({
   props: {
       ...(await serverSideTranslations(locale, ['common']))
   }
});



export default PrivacyPolicy 