import { t } from "@/components/language";
import ToggleSwitch from "@/components/starndart/ToggleSwitch";
import { useLanguage } from "@/language/ LanguageContext";
import { ChangeEvent, useState } from "react";
import { Container } from "react-bootstrap";
import Head from "next/head";


const PrivacyPolicy = () => {
    const { language, setLanguage } = useLanguage();
    const [isTh, setIsTh] = useState(true);

    const handleToggle = (event: ChangeEvent<HTMLInputElement>) => {
        setIsTh(event.target.checked);

        const newLanguage = event.target.checked ? 'th' : 'en';
        setLanguage(newLanguage);

    };
    return (
        <div>
            <Head>
                <title>นโยบายความเป็นส่วนตัว</title>
                <meta name="description" content="Meta description for the Home page" />
            </Head>
            <Container fluid="true" className="text-light text-center bg-dark pt-5" >
                <Container fluid className="pt-5 pb-2" style={{ backgroundColor: "#1F1F21" }}>
                    <figure className="text-center pt-4 pb-4 text-light">
                        <blockquote className="blockquote">
                            <p className="display-4">นโยบายความเป็นส่วนตัว</p>
                        </blockquote>

                    </figure>
                    <Container className="text-light text-center">
                        <h3>{t("language", language)}</h3>
                        <ToggleSwitch isOn={isTh} handleToggle={handleToggle} />
                        <p>{isTh ? 'TH' : 'EN'}</p>
                        <Container className="d-flex justify-content-center">
                        </Container>
                    </Container>

                </Container>
                <Container className="pt-4 ps-4 pe-4">
                    <Container className="p-2 text-start">
                        <p className="">
                            ในฐานะผู้พัฒนาและทีมงานของเว็บไซต์ Prompt Lab (www.prompt.sutmeme.com) ทางทีมงานได้ตระหนักถึงความสำคัญของความเป็นส่วนตัวของผู้ใช้ทุกท่าน เราจึงให้ควาามเชื่อมั่นแก่ทุกท่านว่าข้อมูลส่วนบุคคลทั้งหมดของท่านจะได้รับความคุ้มครองและ
                            รับประกันว่าจะปกป้องและประมวลผลข้อมูลส่วนบุคคลด้วยมาตรการรักษาความมั่นคงปลอดภัยที่เหมาะสม
                            อย่างดีที่สุดและด้วยชอบด้วยกฏหมาย
                        </p>
                    </Container>
                    <Container className="p-2 text-start">
                        <p>
                            ทางทีมงานอาจปรับปรุงนโยบายความเป็นส่วนตัวฉบับนี้ตามแต่ละระยะเวลา เพื่อให้สอดคล้องกับแนวปฏิบัติและกฎหมายที่เกี่ยวข้อง
                            และให้สอดคล้องกับการให้บริการต่างๆ ทั้งนี้ ทางทีมงานจะแจ้งให้ท่านทราบถึงการเปลี่ยนแปลง
                            ด้วยการประกาศนโยบายฉบับปรับปรุงใหม่ผ่านทางเว็บไซต์
                        </p>
                    </Container>

                    <Container className="text-start display-6 pt-4 p-0">
                        <div className="pb-2"> การเก็บข้อมูลส่วนบุคคล </div>
                        <hr className="m-0 mb-2 bg-white " style={{ height: "1px" }} />
                    </Container>
                    <Container className="text-start pt-4">
                        <div className="pb-4">
                            <b> {"(1) ข้อมูลส่วนบุคคล"} </b>
                            <div>
                                {"\"ข้อมูลส่วนบุคคล\""} คือ ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้น
                                ได้ไม่ว่าทางตรงหรือทางอ้อม โดยที่เรานั้นได้รวบรวมข้อมูลส่วนบุคคลในกรณีที่จำเป็นและใช้ข้อมูลเท่านั้น
                                ประกอบไปด้วย
                            </div>
                            <div>
                                <li> ชื่อ-นามสกุล(ไม่จำเป็น) </li>
                                <li> อีเมลของผู้ใช้ </li>


                            </div>
                        </div>

                        <div className="pb-2">
                            <b> {"(2) ข้อมูลที่ไม่สามารถระบุตัวตนได้"} </b>
                            <p>
                                {"\"ข้อมูลที่ไม่สามารถระบุตัวตน\""} คือข้อมูลที่ไม่สามารถระบุตัวตนของบุคคลได
                                ซึ่งไม่ได้เชื่อมโยงกับข้อมูลส่วนบุคคล โดยตัวอย่างเช่น ข้อมูล IP Address ของผู้ใช้,
                                ข้อมูลเวลาเข้าเว็บไซต์, ข้อมูลเบราว์เซอร์ที่ใช้, ข้อมูลสถิติการใช้งานเว็บไซต์,
                                ข้อมูลการใช้งานเว็บไซต์ในแต่ละช่วงเวลา, ข้อมูลการใช้ฟีเจอร์แต่ละส่วน เป็นต้น
                            </p>
                        </div>

                        <div className="pb-2">
                            <b> {"(3) ข้อมูลการใช้งาน"} </b>
                            <p>
                                {"\"ข้อมูลการใช้งาน\""} คือข้อมูลการใช้งานเว็บไซต์ของผู้ใช้ ได้แก่ ประวัติการใช้งานแต่ละฟีเจอร์ของผู้ใช้,
                                ประวัติการสร้างข้อความของผู้ใช้แต่ละคน, ประวัติการคลิ๊กเข้าโฆษณา
                            </p>
                        </div>

                        <div className="pb-4">
                            <b> {"(4) คุกกี้และเทคโนโลยีติดตาม"} </b>
                            <p>
                                {"\"คุกกี้\""} คือ ไฟล์ขนาดเล็กที่เก็บไว้บนคอมพิวเตอร์ของคุณ (หรืออุปกรณ์อื่น ๆ ที่ต่ออินเตอร์เน็ต เช่น
                                สมาร์ทโฟนหรือแท๊บเล็ต)
                            </p>
                        </div>

                        <div>
                            <h5>การเก็บข้อมูลส่วนบุคคลจะเกิดขึ้นอยู่ 3 กรณี ได้แก่</h5>
                            <div>
                                <b> {"(1) เมื่อมีการเข้าสู่ระบบ"} </b>
                                <p>
                                    เมื่อมีการเข้าสู่ระบบ ระบบจะบันทึกข้อมูลการเข้าสู่ระบบ ได้แก่ ชื่อผู้ใช้และอีเมล
                                    เพื่อวิเคราะห์ข้อมูลการใช้งานเว็บไซต์ เช่น ปริมาณการเข้าถึงเว็บไซต์ในแต่ละช่วงเวลา,
                                    ช่วงเวลาที่ผู้ใช้งานใช้เว็บไซต์มากที่สุด และอื่นๆ
                                </p>
                            </div>


                            <div>
                                <b> {"(2) เมื่อมีการกดคลิ๊กเข้าโฆษณา"} </b>
                                <p>

                                    เมื่อมีการกดคลิ๊กเข้าโฆษณา เมื่อผู้ใช้งานคลิ๊กเข้าโฆษณา ระบบจะบันทึกข้อมูลการคลิกโฆษณา
                                    ได้แก่ โฆษณาที่ถูกคลิ๊ก, ผู้ใช้ที่กดเข้าโฆษณา,
                                    วันเวลาที่กดเข้าโฆษณา
                                </p>
                            </div>

                            <div>
                                <b> {"(3) เมื่อมีการกดสร้างข้อความ"} </b>
                                <p>
                                    เมื่อมีการกดสร้างข้อความ เมื่อผู้ใช้งานกดสร้างข้อความ เช่น เขียนแคปชั่นขายของ, ช่วยคิดคอนเทนต์
                                    ระบบจะบันทึกข้อมูลการสร้างข้อความ ได้แก่ ผู้ใช้ที่สร้าง, ข้อความที่เป็น Input,
                                    ลักษณะของข้อความที่จะสร้าง, วันเวลาที่กดสร้าง และข้อความผลลัพธ์ที่ได้
                                </p>
                            </div>
                        </div>
                    </Container>
                    <Container className="text-start display-6 pt-4">
                        <div className="pb-2"> เราจะนำข้อมูลส่วนบุคคลไปใช้อะไรบ้าง </div>
                        <hr className="m-0 mb-2 bg-white " style={{ height: "1px" }} />
                    </Container>
                    <Container className="text-start">
                        <text>
                            <br /> 1. การปรับปรุงและพัฒนาผลิตภัณฑ์และบริการ
                            <br /> 2. การสื่อสารกับผู้ใช้งาน
                            <br /> 3. การวิเคราะห์และทำสถิติ
                            <br /> 4. การตรวจสอบความปลอดภัยและป้องกันการโจมตี
                            <br /> <br />  .การปฏิบัติตามข้อกำหนดและกฎหมายที่เกี่ยวข้อง
                        </text>
                    </Container>
                    <Container className="display-6 pt-4 text-start">
                        <div className="pb-2"> การแชร์ข้อมูลกับบุคคลที่สาม </div>
                        <hr className="m-0 mb-2 bg-white " style={{ height: "1px" }} />
                    </Container>

                    <Container className="text-start">
                        <text>
                            <br /> 1. คู่ค้าและผู้ให้บริการ
                            <br /> 2. การนำข้อมูลไปใช้ในกรณีขายหรือควบคุมธุรกิจ
                            <br /> 3. การเปิดเผยข้อมูลตามข้อกำหนดและกฎหมาย
                        </text>
                    </Container>

                    <Container className="text-start display-6 pt-4">
                        <div className="pb-2"> การจัดเก็บข้อมูลและความปลอดภัย </div>
                        <hr className="m-0 mb-2 bg-white " style={{ height: "1px" }} />

                    </Container>

                    <Container className="text-start">
                        <text>
                            เราให้ความสำคัญในการรักษาความปลอดภัยของข้อมูลของผู้ใช้ ดังนั้น เรามีนโยบายในการจัดเก็บข้อมูลเพื่อให้เป็นไปตามมาตรการความปลอดภัยที่เหมาะสม วิธีการจัดเก็บข้อมูลของเราประกอบด้วยการเก็บข้อมูลแบบเข้ารหัสและเก็บไว้ที่เซิร์ฟเวอร์บนคลาวด์
                            ทีมงาน Prompt Lab อาจไม่สามารถลบข้อมูลทั้งหมดของท่านออกจากฐานข้อมูลของทีมงาน Prompt Lab ได้อย่างสมบูรณ์โดยไม่มีข้อมูลที่เหลืออยู่เนื่องจากการสำรองข้อมูลและเหตุผลอื่นๆ ทีมงาน Prompt Lab จะเก็บรักษาข้อมูลของท่านตราบเท่าที่ข้อมูลนั้นยังจำเป็นสำหรับวัตถุประสงค์ของการรวบรวมข้อมูล ในกรณีที่ท่านยุติความสัมพันธ์ทางธุรกิจกับทีมงาน Prompt Lab ไปแล้ว ทีมงาน Prompt Lab จะจัดเก็บข้อมูลส่วนบุคคลของท่านไว้เป็นระยะเวลา 10 ปี ซึ่งเป็นไปตามที่กฎหมายกำหนด เช่น กฎหมายว่าด้วยการบัญชี กฎหมายว่าด้วยการป้องกันและปราบปรามการฟอกเงิน กฎหมายภาษีอากร และตามนโยบาย คู่มือต่างๆ ในเรื่องการจัดเก็บและทำลายเอกสารต่างๆ ของทีมงาน Prompt Lab และเมื่อสิ้นสุดระยะเวลาในการเก็บแล้วทีมงาน Prompt Lab จะทำการลบทำลาย หรือทำให้ข้อมูลดังกล่าวไม่สามารถระบุถึงตัวบุคคลได้
                        </text>
                    </Container>


                    <Container className="display-6 pt-4 text-start">
                        <div className="pb-2">สิทธิของผู้ใช้งาน</div>
                        <hr className="m-0 mb-2 bg-white " style={{ height: "1px" }} />
                    </Container>


                    <Container className="pt-3 text-start">
                        <div className="pb-4">
                            ทีมงาน Prompt Lab มีนโยบายให้ผู้ใช้สามารถจำกัดสิทธิ์ในการเข้าถึงข้อมูลของทีมงาน Prompt Lab ได้โดยจะคำนึงถึงความปลอดภัยของข้อมูลของผู้ใช้งาน
                            โดยผู้ใช้งานสามารถขอให้ทางทีมงาน Prompt Lab
                        </div>
                        <div>
                            <b> {"(1) สิทธิในการขอเข้าถึงข้อมูล"} </b>
                            <p>
                                สิทธิ์ในการขอเข้าถึงข้อมูล การขอให้เปิดเผยและโอนข้อมูลส่วนบุคคลไปยังบุคคลอื่นด้วยวิธีการอัตโนมัติ
                                การจำกัดหรือระงับการใช้ การปฏิเสธการประมวลผลข้อมูล ผู้ใช้สามารถขอให้ทางทีมงานของเว็บไซต์
                                Prompt Lab จำกัดสิทธิ์ในการขอเข้าถึงข้อมูลได้
                            </p>
                        </div>

                        <div>
                            <b> {"(2) สิทธิในการแก้ไขหรือลบข้อมูล"} </b>
                            <p>
                                การแก้ไข หรือลบข้อมูลส่วนบุคคล ผู้ใช้งานสามารถแก้ไข หรือลบข้อมูลส่วนบุคคลของท่านได้ตลอดเวลา
                                โดยทั้งนี้ การลบข้อมูลอาจทำให้ผู้ใช้งานไม่สามารถรับบริการบางส่วนของทางเว็บไซต์ Prompt Lab ได้
                                หรืออาจทำให้การให้บริการหรือการใช้งานไม่ดีเท่าที่ควร
                            </p>
                        </div>

                        <div>
                            <b> {"(3) สิทธิในการยกเลิกความยินยอม"} </b>
                            <p>
                                สิทธิ์ในการยกเลิกความยินยอม ผู้ใช้งานสามารถถอน หรือยกเลิกความยินยอมของท่านได้ให้แก่ทีมงาน Prompt Lab
                                เกี่ยวกับการประมวลผลข้อมูลหรือกิจกรรมที่เฉพาะเจาะจงต่างๆได้ในทุกเวลา
                            </p>
                        </div>

                    </Container>

                    <Container className="text-start pt-4 pb-4">
                        <p className="">
                            ทีมงาน Prompt Lab มีนโยบายความเป็นส่วนตัวในการแชร์ข้อมูลกับบุคคลที่สามที่มุ่งเน้นในการคุ้มครองข้อมูลส่วนบุคคลของลูกค้า โดยเราจะไม่ขายหรือให้เช่าข้อมูลส่วนบุคคลของคุณให้แก่บุคคลที่สามโดยไม่ได้รับความยินยอมจากคุณ
                            ข้อมูลส่วนบุคคลของคุณอาจถูกแชร์เมื่อจำเป็นสำหรับการให้บริการ การปฏิบัติตามกฎหมาย หรือเพื่อปรับปรุงบริการ
                            โดยทีมงาน Prompt Lab จะใช้มาตรการความปลอดภัยที่เหมาะสมในการป้องกันข้อมูลของคุณจากการเข้าถึง การเปิดเผย
                            การปรับปรุง หรือการทำลายโดยไม่ได้รับอนุญาต อย่างไรก็ตาม ความปลอดภัยของข้อมูลบนอินเทอร์เน็ตไม่สามารถรับประกันได้
                            100%
                        </p>
                        <p>
                            โดยทั้งนี้หากท่านมาความประสงค์ที่จะใช้สิทธิ์ต่างๆของผู้ใช้งานที่ได้กำหนดไว้ในข้างต้น ท่านสามารถติดต่อกับ
                            ทางทีมงานของเว็บไซต์ Prompt Lab ผ่านช่องทาง Email : <b><u>just.solution.th@gmail.com</u> </b>
                            ได้ตลอด 24 ชั่วโมง
                        </p>
                    </Container>
                    {/* 
                */}
                </Container>

            </Container>
        </div>

    );
}



export default PrivacyPolicy 